Repository: shmygov/browserpedals
Catalog: src/browserpedals/pedals/detect/ui/i18n/locale/*/LC_MESSAGES/browserpedals.po
Languages: ru

source: Wait for new browser window to open.
ru: Подождите, пока откроется новое окно браузера.

source: browser is not supported
ru: браузер не поддерживается

source: Please Wait...
ru: Пожалуйста, подождите...

source: Were the pedals plugged in?
ru: Педали были подключены?

source: If not, plug them in and then answer 'no'.
ru: Если нет, подключите их, после чего ответьте 'нет'.

source: Mac is not supported yet
ru: Mac пока не поддерживается

source: Testing the pedals...
ru: Проверяем работу педалей...

source: During
ru: В течение

source: seconds press each pedal at least once.
ru: секунд нажмите каждую педаль хотя бы один раз.

source: Pedals are working!
ru: Педали работают!

source: Pause/Play pedal pressed
ru: Педаль Пауза/Воспроизведение нажата

source: Jump Back pedal pressed
ru: Педаль Возврата назад нажата

source: Pause/Play pedal released
ru: Педаль Пауза/Воспроизведение отпущена

source: Jump Back pedal released
ru: Педаль Возврата назад отпущена

source: Now we will test the pedals.
ru: Приступаем к проверке работы педалей.

source: Are you ready?
ru: Вы готовы?

source: Pause/Play pedal
ru: Педаль Пауза/Воспроизведение

source: Jump Back pedal
ru: Педаль Возврата назад

source: All active pedal roles:
ru: Все активные роли педалей:

source: Change
ru: Другие

source: Is this device correct?
ru: Это правильное устройство?

source: Saved
ru: Сохранено

source: Detect
ru: Распознаем

source: Wait for the prompt "Press and release
ru: Подождите, пока появится фраза "Нажмите и отпустите

source: Do not press any other buttons and do not move the mouse.
ru: Не нажимайте никакие другие кнопки и не двигайте мышью.

source: Sorry, no HID devices found
ru: К сожалению, HID-устройства не найдены

source: Press and release
ru: Нажмите и отпустите

source: Pedal was not pressed (or something else like joystick was constantly pressed)
ru: Педаль не была нажата (или постоянно было нажато что-то другое типа джойстика)

source: Now we will detect the pedals.
ru: Приступаем к распознаванию педалей.

source: Each pedal will be detected during
ru: Каждая педаль будет распознаваться в течение

source: seconds.
ru: секунд

source: Y
ru: Д

source: n
ru: н

source: [Enter]
ru: [Ввод]

source: Yes
ru: Да

source: No
ru: Нет
